{"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 80, 3]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "padding": "valid", "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_2", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_4", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_2", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}], ["max_pooling2d_1", 0, 0, {}]]], "class_name": "Add"}, {"name": "conv2d_5", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_5", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_3", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_6", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_6", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_4", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add"}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_7", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_5", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_8", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "name": "conv2d_8", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_6", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "epsilon": 0.001, "scale": true, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation"}, {"name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]], "class_name": "Add"}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "padding": "valid", "name": "conv2d_9", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"name": "dense_1", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 128}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"name": "dense_2", "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 512}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"name": "dense_3", "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 512}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"name": "dense_4", "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 1}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.0.0", "class_name": "Model", "backend": "tensorflow"}