{"backend": "theano", "keras_version": "2.0.0", "config": [{"config": {"dtype": "float32", "filters": 32, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 63, 63, 3], "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "kernel_size": [1, 3], "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.7}, "class_name": "Dropout"}, {"config": {"units": 2, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}