{"config": [{"config": {"padding": "valid", "use_bias": true, "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 63, 63, 3], "activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "use_bias": true, "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_size": [1, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "use_bias": true, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "use_bias": true, "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 64, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.7}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "units": 2, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.2"}